[
	{
		"thumb": "myles_cooper.jpg",
		"name": "Myles Cooper",
		"bio": "<p>Myles’ extra-curricular interests bounce around more frequently than they probably should, but several of them stay consistent no matter what: singing, theater, and longboarding. His experience harmonizing with others is starting out limited, so he is stoked to take full advantage of his time in PowerChords to develop his skills in the midst of such talented people.</p>",
		"class_number": "2016",
		"major": "Undeclared",
		"hometown": "Who knows?"
	},
	{
		"thumb": "elliott_donlon.jpg",
		"name": "Elliot Donlon",
		"bio": "<p>Hailing from the island nation of Hawaii, Elliott enjoys Boston and its cold weather. While engineering is a primary focus, singing comes in a close second and he is jumping up and down inside to be in PowerChords. When not singing, or messing with machines, he also enjoys Frisbee, glass-blowing, and the snow.</p>",
		"class_number": "2014",
		"major": "Undeclared",
		"hometown": "?, HI"
	},
	{
		"thumb": "trevor_hooton.jpg",
		"name": "Trevor Hooton",
		"bio": "<p>Trevor is an engineer, a singer, a lover, a fighter, a twin and a Canadian. His classily untrained tenor is happy to harmonize with all the superbly talented members of Power Chords (without whom he would have nobody to sing with but his rubber duck.)</p>",
		"class_number": "2014",
		"major": "Robo E",
		"hometown": "Canada"
	},
	{
		"thumb": "janaki_perera.jpg",
		"name": "Janaki Perera",
		"bio": "<p>Janaki is a matsci major from the sunshine state and is super excited to be in Power Chords! While she has never sung for actual people before, she has played a few instruments. Janaki likes to spend her time dancing around, wearing footed pajamas, starting (and finishing!) crazy projects, baking, reading novels, and doing some engineering somewhere in there.</p>",
		"class_number": "2014",
		"major": "MatSci",
		"hometown": "Jacksonville, FL"
	},
	{
		"thumb": "geoff_thumb.jpg",
		"name": "Geoff Pleiss",
		"bio": "<p>An instrumentalist by trade, Geoff was brought to the Dark Side (by which he means a cappella) when he came to Olin. Originally a classically trained pianist, Geoff spent most of his years playing bass for jazz bands and his high-school orchestra. He had not done very much singing until he joined PowerChords his freshman year, but now he is thrilled to be singing all the time. Geoff is super enthusiastic about PowerChords, and is really excited that he has the opportunity to co-direct the group this year. When he is not singing, he enjoys playing guitar and bass, nerding out about advanced music theory, running, biking, adventuring, and being a snob about coffee.</p>",
		"class_number": "2013",
		"major": "E:C w/Math",
		"hometown": "The Bay Areas"
	}, 
	{
		"thumb": "kory_thumb.jpg",
		"name": "Kory Kautz",
		"bio": "<p>Kory is a big time music geek, taking as many music classes as he can and playing his four guitars far too much. When he's not playing guitar he's arranging music for Power Chords, and when he's not arranging music he's writing it (though not for Power Chords). He also somehow fits in school work, but that's less important. He spends his summers working in the forests of northern Minnesota, serving on the frontlines of the never ending war against the vegetative scourge of the earth known as trees.</p>",
		"class_number": "2013",
		"major": "MechE",
		"hometown": "Eden Prairie, MN"
	},
	{
		"thumb": "tom_thumb.jpg",
		"name": "Tom Pandolfo",
		"bio": "<p>When he isn't busy taking more credits than he should, Tom enjoys nothing more than making music – whether it's getting behind a piano and rocking out (most likely to Billy Joel), performing in a musical with FWOP or the Babson Players, or singing with his fellow PowerChords. He plays 4.5 instruments, practices lucid dreaming, and if you could get him to sit still long enough he would probably tell you that he enjoys parkour, programming in Python, and all things Italian.</p>",
		"class_number": "2013",
		"major": "Sys E",
		"hometown": "Hampton Bays, Long Island"
	},
	{
        "thumb": "rahil_thumb.jpg",
        "name": "Rahil Dedhia",
        "bio": "<p>Rahil has been involved in music for most of his life, especially as a singer. During his high school years in hometown Pelham, NY, he sang as part of the chorus, select chorus, and took part in the school musical each year. Other than singing, Rahil enjoys theatre and sports, specifically tennis, soccer, and ultimate Frisbee. He has never been involved in a capella before, and is really excited about PowerChords this year.</p>",
        "class_number": "2016",
        "major": "Undeclared",
        "hometown": "Pelham, NY"
    },
	{
		"thumb": "paige_thumb.jpg",
		"name": "Paige Cote",
		"bio": "<p>Paige is a semi-undecided/Bio-E from mid-coast Maine, otherwise known as the place where all the tourists go. She has been singing since she was 8 in a church choir, and was also in all the vocal ensembles possible during high school. When she’s not singing you can probably find her reading, sailing, eating tasty things, or learning about something that will in no way enhance her engineering knowledge.</p>",
		"class_number": "2016",
		"major": "Undeclared",
		"hometown": "ME"
	},
	{
		"thumb": "marena_thumb.jpg",
		"name": "Marena Richardson",
		"bio": "<p>Marena has been singing for most of her life in school choirs, independent choirs, musicals, and even a high school acapella group. She is really excited to be able to continue singing with such an enthusiastic group here at Olin. Her other hobbies include dancing, reading, doing stuff outdoors, and hanging out with the awesome Freshman class.</p>",
		"class_number": "2016",
		"major": "Undeclared",
		"hometown": "RI"
	},
	{
		"thumb": "09laurenglanville-thumb.jpg",
		"name": "Lauren Glanville",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2009",
		"major": "E:Sys",
		"hometown": "Morris Plains, NJ"
	},
	{
		"thumb": "09nikolauswittenstein-thumb.jpg",
		"name": "Nikolaus Wittenstein",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2009",
		"major": "ECE",
		"hometown": "Lagunitas, CA"
	},
	{
		"thumb": "09paulmandel-thumb.jpg",
		"name": "Paul Mandel",
		"bio": "<p>Along with Jon Cass, Paul was one of the founding members of the Power Chords (then the Flaming Minion Sparrows). Paul loves singing and a cappella music and hopes to continue long after he graduates.</p>",
		"class_number": "2009",
		"major": "Robotics",
		"hometown": "Santa Cruz, CA"
	},
	{
		"thumb": "09erinschumacher-thumb.jpg",
		"name": "Erin Schumacher",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2009",
		"major": "E:Systems",
		"hometown": "Redondo Beach, CA"
	},
	{
		"thumb": "10jimswitzer-thumb.jpg",
		"name": "Jim Switzer",
		"bio": "<p>Jim has partaken of some form of vocal activity every year since he was erroneously enrolled in MS Choir in 7th Grade. He has also been known to act occasionally, and hack together engineering projects of various seriousness for the majority of his other waking hours.</p>",
		"class_number": "2010",
		"major": "ECE",
		"hometown": "Cairo, Egypt"
	},
	{
		"thumb": "11zimzimmerman-thumb.jpg",
		"name": "Zim Zimmerman",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2011",
		"major": "MechE/SysE",
		"hometown": "Earth"
	},
	{
		"thumb": "delg_thumb.jpg",
		"name": "Dan Elg",
		"bio": "<p>Ever since he took to the stage in \"The Pirates of Penzance\" back in his freshman year of high school, Dan has been fascinated by the art of singing. He can regularly be heard walking around the campus singing whatever happens to be in his head. After going theatre-heavy with six shows last year, Dan has used this year to jump into the deep end of singing and do everything he can to produce high-quality vocal music at Olin. In addition to directing the Power Chords, he founded and directed a Christmas carol octet last semester. He also currently sings in three additional choirs. And if you couldn't tell yet, he's also insane. :P</p>",
		"class_number": "2011",
		"major": "ECE",
		"hometown": "Wheaton, IL"
	},
	{
		"thumb": "11nickpayton-thumb.jpg",
		"name": "Nick Payton",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2011",
		"major": "Mech:E",
		"hometown": "Earth"
	},
	{
		"thumb": "12ashleylloyd-thumb.jpg",
		"name": "Ashley Lloyd",
		"bio": "<p>Besides Power Chords, Ashley hasn’t sung in public since her third grade musical. Despite this, she loves being in an a capella group and especially loves singing along to Dr. Horrible and Disney songs at the top of her lungs when no one is listening.</p>",
		"class_number": "2012",
		"major": "Undeclared",
		"hometown": "Olympia, WA"
	},
	{
		"thumb": "12graythomas-thumb.jpg",
		"name": "Gray Thomas",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2012",
		"major": "Undeclared",
		"hometown": "Iowa City, IA"
	},
	{
		"thumb": "12laurenreed-thumb.jpg",
		"name": "Lauren Reed",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "?",
		"major": "Undeclared",
		"hometown": "Seattle, WA"
	},
	{
		"thumb": "12jasoncurtis-thumb.jpg",
		"name": "Jason Curtis",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2012",
		"major": "Undeclared",
		"hometown": "Herndon, VA"
	},
	{
		"thumb": "12jessierucker.jpg",
		"name": "Jessie Rucker",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2012",
		"major": "Undeclared",
		"hometown": "Del Mar, CA"
	},
	{
		"thumb": "12rosezeller-thumb.jpg",
		"name": "Rose Zeller",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2012",
		"major": "Undeclared",
		"hometown": "Mission Viejo, CA"
	},
	{
		"thumb": "12sherwinchao.jpg",
		"name": "Sherwin Chao",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2012",
		"major": "Undeclared",
		"hometown": "New York, NY"
	},
	{
		"thumb": "11rachitanavara.jpg",
		"name": "Rachita Navara",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2011",
		"major": "Undeclared",
		"hometown": "Earth"
	},
	{
		"thumb": "11tiamaindik.jpg",
		"name": "Tiama Hamkins-Indik",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2011",
		"major": "Undeclared",
		"hometown": "Northampton, MA"
	},
	{
		"thumb": "10jessimurray.jpg",
		"name": "Jessi Murray",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2010",
		"major": "ECE",
		"hometown": "Earth"
	},
	{
		"thumb": "10bensmall.jpg",
		"name": "Ben Small",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2010",
		"major": "Unknown",
		"hometown": "Peoria, IL"
	},
	{
		"thumb": "09michaelboutelle.jpg",
		"name": "Michael Boutelle",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2009",
		"major": "MechE",
		"hometown": "Del Mar, CA"
	},
	{
		"thumb": "09annavonreden.jpg",
		"name": "Anna von Reden",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2009",
		"major": "E:MatSci",
		"hometown": "Falmouth, MA"
	},
	{
		"thumb": "08joncass.jpg",
		"name": "Jon Cass",
		"bio": "<p>Jon Cass founded the Flaming Minion Sparrows out of a love for music, singing, and organizing. He then went on to co-found the Power Chords with Paul Mandel out of a love of a much better name for an a cappella group. As of 2009, he is a graduate student at UC Santa Barbara working towards his PhD in mathematics.</p>",
		"class_number": "2008",
		"major": "E:Math",
		"hometown": "Acton, MA"
	},
	{
		"thumb": "08markcavolowsky.jpg",
		"name": "Mark Cavolowsky",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2008",
		"major": "Unknown",
		"hometown": "North Potomac, MD"
	},
	{
		"thumb": "07andrewbouchard.jpg",
		"name": "Andrew Bouchard",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2007",
		"major": "Engineering",
		"hometown": "Franklin, TN"
	}
]
