[
	{
		"thumb": "gracey_wilson.jpg",
		"name": "Gracey Wilson",
		"bio": "<p>Gracey, a native Californian who was transplanted to Alaska a few years ago, has always loved to sing. However it's her first time singing in an a Capella group and she's loving it! Music is a big part of her life, but she also enjoys diverse discussion, laughing, and learning. She hopes to use her developing engineering skills to solve problems that elevate people's lives!</p>",
		"class_number": "2020",
		"major": "Engineering with Computing",
		"hometown": "Bradenton, FL"
	},
	{
		"thumb": "william_lu.jpg",
		"name": "William Lu",
		"bio": "<p>William has been playing piano and singing for most of his life and has even dared to try the violin. He apparently never looks tired, despite his desperate attempts to do more activities than there are hours in the week. Other than delighting people by breaking into song at every opportunity, William enjoys blue sky ideation, accessible design, and cobbling together electronics.</p>",
		"class_number": "2018",
		"major": "Electrical/Computer Engineering",
		"hometown": "San Diego, CA"
	},
	{
		"thumb": "franton_lin.jpg",
		"name": "Franton Lin",
		"bio": "<p>Franton has a love for a cappella that started all the way back in 6th grade. The portability and instancy of a cappella combined with its extremely tight-knit community has made it a staple in Franton's life. When not doing music, Franton thoroughly enjoys various hobbies, including digital photography, fiddling with circuits, baking pies, and road cycling. Overall, Franton believes in carpe diem, because there are too many fabulous adventures to experience and never enough time.</p>",
		"class_number": "2018",
		"major": "Electrical and Computer Engineering",
		"hometown": "Mansfield Center, CT"
	},
	{
		"thumb": "michael_costello.jpg",
		"name": "Michael Costello",
		"bio": "<p>Michael Costello has tried being a singer, athlete, guitarist, engineer, programmer, and community organizer, and can't decide which he likes best. He likes trying new things, and in his life has sang soprano, tenor, baritone, bass, and has also dabbled in vocal percussion. He can often be heard belting a tune while running through Needham or Wellesley. He loves making music with his talented, hard-working, and supportive PowerChords \"family\".</p>",
		"class_number": "2018",
		"major": "Mechanical Engineering?",
		"hometown": "Newton, MA"
	},
	{
		"thumb": "tatiana_anthony.jpg",
		"name": "Tatiana Anthony",
		"bio": "<p>Tatiana has been involved with music on and off for most of her life, starting with playing violin, then beginning viola, and now singing.  She was exposed to acapella music at a young age, so she is absolutely thrilled that she's able to join the PowerChords.  Outside of music, she enjoys cooking, drawing, writing, and recreational and competitive mathematics.</p>",
		"class_number": "2017",
		"major": "Mechanical Engineering",
		"hometown": "Near Seattle, WA"
	},
	{
		"thumb": "braden_oh.jpg",
		"name": "Braden Oh",
		"bio": "<p>Braden was a member of church and school choirs for 6 years before joining PowerChords and has been both a performer and a director.  He has performed in many diverse places including Venice, the Sistine Chapel, San Francisco, and Pasadena.   Hobbies include rocketry, magic, popping soap bubbles, howling at the moon, and online bio writing.</p>",
		"class_number": "2021",
		"major": "Undeclared",
		"hometown": "Pasadena, California"
	},
	{
		"thumb": "tommy_weir.jpg",
		"name": "Tommy Weir",
		"bio": "<p>Tommy has been in marching band, concert band, and orchestra during his high school career. He got dragged to a singing audition in his senior year, and discovered his love of singing and performing. Outside of coursework, Tommy plays ultimate frisbee, sings in the experimental vocal ensemble, and enjoys reading.</p>",
		"class_number": "2021",
		"major": "Mechanical Engineering",
		"hometown": "Rome, NY"
	},
	{
		"thumb": "william_derksen.jpg",
		"name": "William \"Wilde\" Derksen",
		"bio": "<p>William has played piano since the age of 4 very loosely.  He has a bit of stage fright but loves to sing!  He is also very into beatboxing and arranging.  William is probably going into Computer science but is also real interested in Electrical engineering.  For now he's just going with the flow and learning along the way.</p>",
		"class_number": "2020",
		"major": "Undeclared",
		"hometown": "Somewhere, Michigan"
	},
	{
		"thumb": "ilya_besancon.jpg",
		"name": "Ilya Besancon",
		"bio": "<p>Ilya is a remarkably silly individual who has an undying love and excitement for music. This means blasting Red Hot Chili Peppers on the highway, shredding to Nirvana on his Gibson SG electric guitar, and even peacefully grooving to Samba in his hammock. He's been playing guitar for 12 years, and writing songs for 3. To recently got to complete a longtime dream of recording and producing his first album, Too Many Places. </p>",
		"class_number": "2020",
		"major": "Undeclared",
		"hometown": "Washington, D.C."
	},
	{
		"thumb": "daniel_daugherty.jpg",
		"name": "Daniel Daugherty",
		"bio": "<p>Daniel grew up playing the piano, violin, saxophone, and bass clarinet in various concert bands.  A Capella group singing is new experience for him and he's super excited about it! Outside of music, Daniel enjoys playing basketball, shredding on the snowboard, and eating lots of food.</p>",
		"class_number": "2019",
		"major": "Undeclared",
		"hometown": "Huntsville, AL"
	},
	{
		"thumb": "celina_bekins.jpg",
		"name": "Celina Bekins",
		"bio": "<p>Celina is awesome! They're one of the Webmaster's best friends. However, they have been really too busy to write their own bio, so the Webmaster is writing it for them. Celina has done music and theatre all their life, and loves creating art with other people.</p>",
		"class_number": "2018",
		"major": "Human-Centered Software Design",
		"hometown": "Maui County, HI"
	},
	{
		"thumb": "jenny_vacarro.jpg",
		"name": "Jenny Vaccaro",
		"bio": "<p>Jenny Vaccaro considers herself remarkably lucky to join PowerChords! She experienced a downright cathartic rendition of her local high school's Fiddler on the Roof in third grade, and the rest is history. By history, she really means a smorgasbord of school-affiliated choral groups and dramatic performances. Jenny's other interests include piano, soccer, poetry, and the use of unnecessarily long words in daily conversation.</p>",
		"class_number": "2017",
		"major": "Electrical and Computer Engineering",
		"hometown": "Reading, MA"
	},
	{
		"thumb": "alex_crease.jpg",
		"name": "Alex Crease",
		"bio": "<p>Alex has been playing a variety of instruments since he was 3, including the fiddle, the guitar, and at one point the trombone (except his arms were too short to reach the low notes). He hasn’t done much singing outside of the shower until joining PowerChords. He’s probably going to major in robotics engineering, because robots are just the coolest. Apart from music, Alex is extremely enthusiastic about robotics, bad puns, and lookin’ good. He will never skip a beat when it comes to terrible jokes or putting on a bow tie just for fun.</p>",
		"class_number": "2016",
		"major": "Undeclared",
		"hometown": "New York, New York"
	},
	{
		"thumb": "jennifer_anderson.jpg",
		"name": "Jennifer Anderson",
		"bio": "<p>Jennifer has been singing since 4th grade, but never in a choir as small as PowerChords; which makes it all the more exciting and interesting! She loves doing way too many things—so besides PowerChords, she is also interested in 90% of the clubs on campus. Somehow, she also manages to fit in drawing, reading, and collecting classy hats.</p>",
		"class_number": "2016",
		"major": "Mechanical Engineering",
		"hometown": "Louisville, CO"
	},
	{
		"thumb": "bryan_werth.jpg",
		"name": "Bryan Werth",
		"bio": "<p>Bryan has been singing and playing instruments such as the saxophone and the banjo for years. Although he has never been sang a capella, he has been singing in choruses ever since he can remember. Outside of music, Bryan plays tennis, rides the unicycle, and jokes around. Although he is currently undeclared, he is most interested in pursuing a degree in electrical engineering.</p>",
		"class_number": "2019",
		"major": "Undeclared",
		"hometown": "Bedford, MA"
	},
	{
		"thumb": "eric_schneider.jpg",
		"name": "Eric \"The Franz\" Schneider",
		"bio": "<p>Eric has been singing more or less continuously since the beginning of high school, and is super excited to be able to keep singing at Olin. He also plays piano and listens to too many musicals. In addition to regular acapella excitement, he is extremely excited to be at Olin and do a bunch of awesome stuff, only some of which there will be time for. But hey, who really needs sleep?</p>",
		"class_number": "2015",
		"major": "Robotics Engineering",
		"hometown": "Bellingham, WA"
	},
	{
		"thumb": "kyle_mcconnaughay.jpg",
		"name": "Kyle McConnaughay",
		"bio": "<p>Kyle enjoys singing – yes, it's mostly to himself, but he occasionally indulges in the odd Disney karaoke session. He never sang in an a cappella group prior to joining PowerChords and is excited about the opportunity! In addition to singing, Kyle likes to play French horn, piano, chess, soccer, and clown around with friends. He fits in learning about engineering, too, somewhere.</p>",
		"class_number": "2015",
		"major": "E:C",
		"hometown": "McLean, VA"
	},
	{
		"thumb": "riva_kahn_hallock.jpg",
		"name": "Riva Kahn Hallock",
		"bio": "<p>Riva has enjoyed singing for as long as she can remember in musicals, in choir, and to herself. Besides driving her roommate and everyone else crazy with nonstop humming/singing, she also loves playing soccer, scuba diving, playing piano, being green, and trying new things.</p>",
		"class_number": "2015",
		"major": "MechE",
		"hometown": "Oakland, CA"
	},
	{
		"thumb": "ingrid_hagen-keith.jpg",
		"name": "Ingrid Hagen-Keith",
		"bio": "<p>Ingrid's is so excited to be a part of PowerChords that she is charged to sing! (Did you catch that?) She hails from the northern land of Montreal, Canada but has recently been relocated to Kailua, HI. Though never formally trained, Ingrid has been part of various singing groups including a Scottish a cappella group, choir in high school, and has performed various solos, including her senior year closing song. When not singing, Ingrid likes to eat fine foods (om nom nom), run, sew, and talk about not talking. She is ready to rock y'all!</p>",
		"class_number": "2015",
		"major": "MechE",
		"hometown": "Everywhere"
	},
	{
		"thumb": "mitch_cieminski.jpg",
		"name": "Mitch Cieminski",
		"bio": "<p>Mitch is a Mysterious Engineer and he loves to sing. Hailing from Colorado, he is a fan of puzzles, classic rock, running, and baked goods. He is currently trying to learn everything in the Universe, a task that is surprisingly difficult but highly enjoyable.</p>",
		"class_number": "2016",
		"major": "Electrical and Computer Engineering",
		"hometown": "Greeley, CO"
	},
	{
		"thumb": "myles_cooper.jpg",
		"name": "Myles Cooper",
		"bio": "<p>Myles’ extra-curricular interests bounce around more frequently than they probably should, but several of them stay consistent no matter what: singing, theater, and longboarding. His experience harmonizing with others is starting out limited, so he is stoked to take full advantage of his time in PowerChords to develop his skills in the midst of such talented people.</p>",
		"class_number": "2016",
		"major": "Undeclared",
		"hometown": "Who knows?"
	},
	{
		"thumb": "elliott_donlon.jpg",
		"name": "Elliot Donlon",
		"bio": "<p>Hailing from the island nation of Hawaii, Elliott enjoys Boston and its cold weather. While engineering is a primary focus, singing comes in a close second and he is jumping up and down inside to be in PowerChords. When not singing, or messing with machines, he also enjoys Frisbee, glass-blowing, and the snow.</p>",
		"class_number": "2014",
		"major": "Undeclared",
		"hometown": "?, HI"
	},
	{
		"thumb": "trevor_hooton.jpg",
		"name": "Trevor Hooton",
		"bio": "<p>Trevor is an engineer, a singer, a lover, a fighter, a twin and a Canadian. His classily untrained tenor is happy to harmonize with all the superbly talented members of Power Chords (without whom he would have nobody to sing with but his rubber duck.)</p>",
		"class_number": "2014",
		"major": "Robo E",
		"hometown": "Canada"
	},
	{
		"thumb": "janaki_perera.jpg",
		"name": "Janaki Perera",
		"bio": "<p>Janaki is a matsci major from the sunshine state and is super excited to be in Power Chords! While she has never sung for actual people before, she has played a few instruments. Janaki likes to spend her time dancing around, wearing footed pajamas, starting (and finishing!) crazy projects, baking, reading novels, and doing some engineering somewhere in there.</p>",
		"class_number": "2014",
		"major": "MatSci",
		"hometown": "Jacksonville, FL"
	},
	{
		"thumb": "geoff_thumb.jpg",
		"name": "Geoff Pleiss",
		"bio": "<p>An instrumentalist by trade, Geoff was brought to the Dark Side (by which he means a cappella) when he came to Olin. Originally a classically trained pianist, Geoff spent most of his years playing bass for jazz bands and his high-school orchestra. He had not done very much singing until he joined PowerChords his freshman year, but now he is thrilled to be singing all the time. Geoff is super enthusiastic about PowerChords, and is really excited that he has the opportunity to co-direct the group this year. When he is not singing, he enjoys playing guitar and bass, nerding out about advanced music theory, running, biking, adventuring, and being a snob about coffee.</p>",
		"class_number": "2013",
		"major": "E:C w/Math",
		"hometown": "The Bay Areas"
	},
	{
		"thumb": "kory_thumb.jpg",
		"name": "Kory Kautz",
		"bio": "<p>Kory is a big time music geek, taking as many music classes as he can and playing his four guitars far too much. When he's not playing guitar he's arranging music for Power Chords, and when he's not arranging music he's writing it (though not for Power Chords). He also somehow fits in school work, but that's less important. He spends his summers working in the forests of northern Minnesota, serving on the frontlines of the never ending war against the vegetative scourge of the earth known as trees.</p>",
		"class_number": "2013",
		"major": "MechE",
		"hometown": "Eden Prairie, MN"
	},
	{
		"thumb": "tom_thumb.jpg",
		"name": "Tom Pandolfo",
		"bio": "<p>When he isn't busy taking more credits than he should, Tom enjoys nothing more than making music – whether it's getting behind a piano and rocking out (most likely to Billy Joel), performing in a musical with FWOP or the Babson Players, or singing with his fellow PowerChords. He plays 4.5 instruments, practices lucid dreaming, and if you could get him to sit still long enough he would probably tell you that he enjoys parkour, programming in Python, and all things Italian.</p>",
		"class_number": "2013",
		"major": "Sys E",
		"hometown": "Hampton Bays, Long Island"
	},
	{
        "thumb": "rahil_thumb.jpg",
        "name": "Rahil Dedhia",
        "bio": "<p>Rahil has been involved in music for most of his life, especially as a singer. During his high school years in hometown Pelham, NY, he sang as part of the chorus, select chorus, and took part in the school musical each year. Other than singing, Rahil enjoys theatre and sports, specifically tennis, soccer, and ultimate Frisbee. He has never been involved in a capella before, and is really excited about PowerChords this year.</p>",
        "class_number": "2016",
        "major": "Undeclared",
        "hometown": "Pelham, NY"
    },
	{
		"thumb": "paige_thumb.jpg",
		"name": "Paige Cote",
		"bio": "<p>Paige is a semi-undecided/Bio-E from mid-coast Maine, otherwise known as the place where all the tourists go. She has been singing since she was 8 in a church choir, and was also in all the vocal ensembles possible during high school. When she’s not singing you can probably find her reading, sailing, eating tasty things, or learning about something that will in no way enhance her engineering knowledge.</p>",
		"class_number": "2016",
		"major": "Undeclared",
		"hometown": "ME"
	},
	{
		"thumb": "marena_thumb.jpg",
		"name": "Marena Richardson",
		"bio": "<p>Marena has been singing for most of her life in school choirs, independent choirs, musicals, and even a high school acapella group. She is really excited to be able to continue singing with such an enthusiastic group here at Olin. Her other hobbies include dancing, reading, doing stuff outdoors, and hanging out with the awesome Freshman class.</p>",
		"class_number": "2016",
		"major": "Undeclared",
		"hometown": "RI"
	},
	{
		"thumb": "09laurenglanville-thumb.jpg",
		"name": "Lauren Glanville",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2009",
		"major": "E:Sys",
		"hometown": "Morris Plains, NJ"
	},
	{
		"thumb": "09nikolauswittenstein-thumb.jpg",
		"name": "Nikolaus Wittenstein",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2009",
		"major": "ECE",
		"hometown": "Lagunitas, CA"
	},
	{
		"thumb": "09paulmandel-thumb.jpg",
		"name": "Paul Mandel",
		"bio": "<p>Along with Jon Cass, Paul was one of the founding members of the Power Chords (then the Flaming Minion Sparrows). Paul loves singing and a cappella music and hopes to continue long after he graduates.</p>",
		"class_number": "2009",
		"major": "Robotics",
		"hometown": "Santa Cruz, CA"
	},
	{
		"thumb": "09erinschumacher-thumb.jpg",
		"name": "Erin Schumacher",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2009",
		"major": "E:Systems",
		"hometown": "Redondo Beach, CA"
	},
	{
		"thumb": "10jimswitzer-thumb.jpg",
		"name": "Jim Switzer",
		"bio": "<p>Jim has partaken of some form of vocal activity every year since he was erroneously enrolled in MS Choir in 7th Grade. He has also been known to act occasionally, and hack together engineering projects of various seriousness for the majority of his other waking hours.</p>",
		"class_number": "2010",
		"major": "ECE",
		"hometown": "Cairo, Egypt"
	},
	{
		"thumb": "11zimzimmerman-thumb.jpg",
		"name": "Zim Zimmerman",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2011",
		"major": "MechE/SysE",
		"hometown": "Earth"
	},
	{
		"thumb": "delg_thumb.jpg",
		"name": "Dan Elg",
		"bio": "<p>Ever since he took to the stage in \"The Pirates of Penzance\" back in his freshman year of high school, Dan has been fascinated by the art of singing. He can regularly be heard walking around the campus singing whatever happens to be in his head. After going theatre-heavy with six shows last year, Dan has used this year to jump into the deep end of singing and do everything he can to produce high-quality vocal music at Olin. In addition to directing the Power Chords, he founded and directed a Christmas carol octet last semester. He also currently sings in three additional choirs. And if you couldn't tell yet, he's also insane. :P</p>",
		"class_number": "2011",
		"major": "ECE",
		"hometown": "Wheaton, IL"
	},
	{
		"thumb": "11nickpayton-thumb.jpg",
		"name": "Nick Payton",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2011",
		"major": "Mech:E",
		"hometown": "Earth"
	},
	{
		"thumb": "12ashleylloyd-thumb.jpg",
		"name": "Ashley Lloyd",
		"bio": "<p>Besides Power Chords, Ashley hasn’t sung in public since her third grade musical. Despite this, she loves being in an a capella group and especially loves singing along to Dr. Horrible and Disney songs at the top of her lungs when no one is listening.</p>",
		"class_number": "2012",
		"major": "Undeclared",
		"hometown": "Olympia, WA"
	},
	{
		"thumb": "12graythomas-thumb.jpg",
		"name": "Gray Thomas",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2012",
		"major": "Undeclared",
		"hometown": "Iowa City, IA"
	},
	{
		"thumb": "12laurenreed-thumb.jpg",
		"name": "Lauren Reed",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "?",
		"major": "Undeclared",
		"hometown": "Seattle, WA"
	},
	{
		"thumb": "12jasoncurtis-thumb.jpg",
		"name": "Jason Curtis",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2012",
		"major": "Undeclared",
		"hometown": "Herndon, VA"
	},
	{
		"thumb": "12jessierucker.jpg",
		"name": "Jessie Rucker",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2012",
		"major": "Undeclared",
		"hometown": "Del Mar, CA"
	},
	{
		"thumb": "12rosezeller-thumb.jpg",
		"name": "Rose Zeller",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2012",
		"major": "Undeclared",
		"hometown": "Mission Viejo, CA"
	},
	{
		"thumb": "12sherwinchao.jpg",
		"name": "Sherwin Chao",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2012",
		"major": "Undeclared",
		"hometown": "New York, NY"
	},
	{
		"thumb": "11rachitanavara.jpg",
		"name": "Rachita Navara",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2011",
		"major": "Undeclared",
		"hometown": "Earth"
	},
	{
		"thumb": "11tiamaindik.jpg",
		"name": "Tiama Hamkins-Indik",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2011",
		"major": "Undeclared",
		"hometown": "Northampton, MA"
	},
	{
		"thumb": "10jessimurray.jpg",
		"name": "Jessi Murray",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2010",
		"major": "ECE",
		"hometown": "Earth"
	},
	{
		"thumb": "10bensmall.jpg",
		"name": "Ben Small",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2010",
		"major": "Unknown",
		"hometown": "Peoria, IL"
	},
	{
		"thumb": "09michaelboutelle.jpg",
		"name": "Michael Boutelle",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2009",
		"major": "MechE",
		"hometown": "Del Mar, CA"
	},
	{
		"thumb": "09annavonreden.jpg",
		"name": "Anna von Reden",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2009",
		"major": "E:MatSci",
		"hometown": "Falmouth, MA"
	},
	{
		"thumb": "08joncass.jpg",
		"name": "Jon Cass",
		"bio": "<p>Jon Cass founded the Flaming Minion Sparrows out of a love for music, singing, and organizing. He then went on to co-found the Power Chords with Paul Mandel out of a love of a much better name for an a cappella group. As of 2009, he is a graduate student at UC Santa Barbara working towards his PhD in mathematics.</p>",
		"class_number": "2008",
		"major": "E:Math",
		"hometown": "Acton, MA"
	},
	{
		"thumb": "08markcavolowsky.jpg",
		"name": "Mark Cavolowsky",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2008",
		"major": "Unknown",
		"hometown": "North Potomac, MD"
	},
	{
		"thumb": "07andrewbouchard.jpg",
		"name": "Andrew Bouchard",
		"bio": "<p>Coming Soon...</p>",
		"class_number": "2007",
		"major": "Engineering",
		"hometown": "Franklin, TN"
	}
]
