[
	{
		"thumb": "eriel_leah.jpg",
		"name": "Eriel Leah",
		"bio": "<p>Eriel has been singing for several years, between doing musical theater in middle school and hobby-singing/songwriting independently throughout high school. This is Eriel’s second a cappella experience, the first being a small group in her summer camp, and she’s so happy to be doing it again! In addition to singing, she dabbles in piano, guitar, and ukulele. While Eriel’s truest love is music, other passions include math, writing, and spending time with her friends.</p>",
		"class_number": "2022",
		"major": "Undeclared",
		"hometown": "Somewhere"
	 },
	 {
		 "thumb": "nathan_weil.jpg",
		 "name": "Nathan Weil",
		 "bio": "<p>Nathan has been singing for about 8 years. From school choirs, to a gospel choir, to messing around with a couple instruments, Nathan has always loved music. This is his first time in a real a cappella group. Besides music, Nathan also enjoys building small flying contraptions, photography, and hiking!</p>",
		 "class_number": "2022",
		 "major": "Undeclared",
		 "hometown": "Somewhere"
		},
		{
			"thumb": "katie_goldstein.jpg",
			"name": "Katie Goldstein",
			"bio": "<p>Katie has been singing for two years in her high school choir and a cappella group. She also plays violin and used to play piano too. Outside of music, Katie loves biking, snowboarding, growing plants, baking yummy sweets, singing horribly in the car and exploring new places and things.</p>",
			"class_number": "2022",
			"major": "Undeclared",
			"hometown": "Somewhere"
		 },
		 {
 			"thumb": "meagan_rittmanic.jpg",
 			"name": "Meagan Rittmanic",
 			"bio": "<p>Meagan has been involved in music since she started the viola in kindergarden. She started singing in choir in fourth grade, learned the guitar in seventh, and really became a choir kid in high school. She joined a vocal jazz group where she fell in love with complicated a cappella ballads. She’s very excited to be in PowerChords, the first a cappella group she’s ever been in. Outside of music, she loves camping, canoeing, climbing, and adventures of all sorts.</p>",
 			"class_number": "2022",
 			"major": "Undeclared",
 			"hometown": "Somewhere"
 		 },
		 {
				"thumb": "meg_ku.jpg",
				"name": "Meg Ku",
				"bio": "<p>Meg is overjoyed to be singing with PowerChords. When she was in grade school she starred as Jafar in Aladdin Jr., and since then she’s been an “honorary tenor”. In her free time she loves to fold origami, play tennis, and eat ice cream. She is always down for dim sum or escape rooms. Meg firmly believes in being happy, and hopes to make her friends smile daily.</p>",
				"class_number": "2022",
				"major": "Undeclared",
				"hometown": "Somewhere"
		},
		{
			 "thumb": "annie_kroo.jpg",
			 "name": "Annie Kroo",
			 "bio": "<p>Annie has been singing for other people ever since middle school when she gave up her 12 year streak of playing the violin because she realized she really didn’t like the sound of violins. She is commonly berated for her love of country, folk, and pop music by her friends. More generally, Annie likes playing soccer, pontificating the structure of engineering education, and perusing electrical engineering primarily because she wants to be a wizard and thinks that controlling lightning bolts is pretty much magic.</p>",
			 "class_number": "2020",
			 "major": "Undeclared",
			 "hometown": "Somewhere"
	 },
	 {
			"thumb": "adam_selker.jpg",
			"name": "Adam Selker",
			"bio": "<p>Adam has grown up playing piano and saxophone, but Power Chords is his first foray into singing. Before, when without an instrument, he just whistled instead, to the annoyance of anyone in earshot. Apart from making music, Adam enjoys mountain biking, flying model aircraft, and yelling at computers.</p>",
			"class_number": "2020",
			"major": "Undeclared",
			"hometown": "Somewhere"
	},
	{
		"thumb": "colvin_chapman.jpg",
		"name": "Colvin Chapman",
		"bio": "<p>Colvin is last in the line of four siblings in a very musical family. He's been singing ever since his parents sang him to sleep at night. Colvin has really enjoyed playing the trombone since fourth grade, and is currently a member of the Olin Rock Orchestra. Being outside playing frisbee, skiing, climbing trees, backpacking, and canoeing are some of his favorite things about growing up in the Adirondack State Park in New York. Colvin's lanky smile is also a source of energy for activities like making model rockets and folding origami.</p>",
		"class_number": "2020",
		"major": "Mechanical Engineering",
		"hometown": "Ticonderoga, NY"
	},
	{
		"thumb": "linnea_laux.jpg",
		"name": "Linnea Laux",
		"bio": "<p>Linnea dabbled in piano as a young child before settling on bass clarinet and playing for 9 years (with breaks for eating and sleeping). She accidentally joined chorus during her junior year of high school, fell in love with singing, and never looked back. In her spare time, she enjoys running, pickup sports, food, and reading.</p>",
		"class_number": "2019",
		"major": "Electrical and Computer Engineering",
		"hometown": "Buffalo, NY"
	 },
	 {
		 "thumb": "gretchen_rice.jpg",
		 "name": "Gretchen Rice",
		 "bio": "<p> Gretchen has been involved in music forever. From singing horribly with her family to joining all of the high school groups she could, Gretchen has always been involved in music! This is Gretchen’s first time involved in an acapella group. Other than singing she also plays violin and trumpet! Other than music, Gretchen loves, baking, education, robots, and math!</p>",
		 "class_number": "2020",
		 "major": "Engineering with Robotics",
		 "hometown": "Washington, D.C."
	 },
	 {
		 "thumb": "toby_shapinsky.jpg",
		 "name": "Toby Shapinsky",
		 "bio": "<p>Toby has been singing for about as long as he could talk. Until now most of his singing experience had been constrained to the shower. He enjoys playing Guitar, Bass, Piano, and Violin as well as experimenting with different ways to record music. He has always wanted to be part of an a capella group, and in the summer before joining Powerchords he practiced with the JPL chorus.</p>",
		 "class_number": "2020",
		 "major": "Engineering with Computing",
		 "hometown": "Washington, D.C."
	},
	{
		"thumb": "kim_winter.jpg",
		"name": "Kim Winter",
		"bio": "<p>Kim has been singing and performing since she was in middle school. She loves cats and has three and hopes to own many more. She enjoys playing ukulele and listening to folk music in her spare time. Her favorite Disney princess is Tiana from \"The Princess and the Frog\", and she hopes to be an Imagineer one day.</p>",
		"class_number": "2019",
		"major": "Undeclared",
		"hometown": "Port Washington, NY"
	},
	{
		"thumb": "katie_butler.jpg",
		"name": "Katie Butler",
		"bio": "<p>Katie Butler is super pumped to be a part of PowerChords! Although this is her first time doing a cappella, Katie has been in audition choirs of various sorts since the fifth grade up until high school, where she decided she was too cool for that and started doing musical theatre instead. She‘s moved around a lot growing up but is happy to be settled in at Olin and is looking forward to her time singing with this group of amazing people. In her spare time she likes to eat free food other people make on campus and procrastinate. This bio is a prime example.</p>",
		"class_number": "2019",
		"major": "Undeclared",
		"hometown": "Erie, PA"
	},
	{
		"thumb": "lauren_gulland.jpg",
		"name": "Lauren Gulland",
		"bio": "<p>Lauren has been an instrumentalist all her life, with her primary and secondary instruments being euphonium and trombone, respectively. Being in PowerChords is a brand new experience for her, and that means she loves every moment that much more. Outside of music, Lauren is interested in mechanical design, biomimetics and biomechatronics, and robotics.   </p>",
		"class_number": "2019",
		"major": "Biomechanical Engineering",
		"hometown": "Manhattan Beach, CA"
	}
]
