[
	{
		"thumb": "alex_crease.jpg",
		"name": "Alex Crease",
		"bio": "<p>Alex has been playing a variety of instruments since he was 3, including the fiddle, the guitar, and at one point the trombone (except his arms were too short to reach the low notes). He hasn’t done much singing outside of the shower until joining PowerChords. He’s probably going to major in robotics engineering, because robots are just the coolest. Apart from music, Alex is extremely enthusiastic about robotics, bad puns, and lookin’ good. He will never skip a beat when it comes to terrible jokes or putting on a bow tie just for fun.</p>",
		"class_number": "2016",
		"major": "Undeclared",
		"hometown": "New York, New York"
	},
	{
		"thumb": "jennifer_anderson.jpg",
		"name": "Jennifer Anderson",
		"bio": "<p>Jennifer has been singing since 4th grade, but never in a choir as small as PowerChords; which makes it all the more exciting and interesting! She loves doing way too many things—so besides PowerChords, she is also interested in 90% of the clubs on campus. Somehow, she also manages to fit in drawing, reading, and collecting classy hats.</p>",
		"class_number": "2016",
		"major": "Mechanical Engineering",
		"hometown": "Louisville, CO"
	},
	{
		"thumb": "jenny_vacarro.jpg",
		"name": "Jenny Vaccaro",
		"bio": "<p>Jenny Vaccaro considers herself remarkably lucky to join PowerChords! She experienced a downright cathartic rendition of her local high school's Fiddler on the Roof in third grade, and the rest is history. By history, she really means a smorgasbord of school-affiliated choral groups and dramatic performances. Jenny's other interests include piano, soccer, poetry, and the use of unnecessarily long words in daily conversation.</p>",
		"class_number": "2017",
		"major": "Undeclared",
		"hometown": "Who knows?"
	},
	{
		"thumb": "tatiana_anthony.jpg",
		"name": "Tatiana Anthony",
		"bio": "<p>Tatiana has been involved with music on and off for most of her life, starting with playing violin, then beginning viola, and now singing.  She was exposed to acapella music at a young age, so she is absolutely thrilled that she's able to join the PowerChords.  Outside of music, she enjoys cooking, drawing, writing, and recreational and competitive mathematics.</p>",
		"class_number": "2017",
		"major": "Undeclared",
		"hometown": "Who knows?"
	}
]
