[
	{
		"thumb": "elliott_thumb.jpg",
		"name": "Elliot Donlon",
		"bio": "<p>Hailing from the island nation of Hawaii, Elliott enjoys Boston and its cold weather. While engineering is a primary focus, singing comes in a close second and he is jumping up and down inside to be in PowerChords. When not singing, or messing with machines, he also enjoys Frisbee, glass-blowing, and the snow.</p>",
		"class_number": "2014",
		"major": "Undeclared",
		"hometown": "?, HI"
	},
	{
		"thumb": "trevor_thumb.jpg",
		"name": "Trevor Hooton",
		"bio": "<p>Trevor is an engineer, a singer, a lover, a fighter, a twin and a Canadian. His classily untrained tenor is happy to harmonize with all the superbly talented members of Power Chords (without whom he would have nobody to sing with but his rubber duck.)</p>",
		"class_number": "2014",
		"major": "Robo E",
		"hometown": "Canada"
	},
	{
		"thumb": "janaki_thumb.jpg",
		"name": "Janaki Perera",
		"bio": "<p>Janaki is a matsci major from the sunshine state and is super excited to be in Power Chords! While she has never sung for actual people before, she has played a few instruments. Janaki likes to spend her time dancing around, wearing footed pajamas, starting (and finishing!) crazy projects, baking, reading novels, and doing some engineering somewhere in there.</p>",
		"class_number": "2014",
		"major": "MatSci",
		"hometown": "Jacksonville, FL"
	},
	{
		"thumb": "kyle_thumb.jpg",
		"name": "Kyle McConnaughay",
		"bio": "<p>Kyle enjoys singing – yes, it's mostly to himself, but he occasionally indulges in the odd Disney karaoke session. He never sang in an a cappella group prior to joining PowerChords and is excited about the opportunity! In addition to singing, Kyle likes to play French horn, piano, chess, soccer, and clown around with friends. He fits in learning about engineering, too, somewhere.</p>",
		"class_number": "2015",
		"major": "E:C",
		"hometown": "McLean, VA"
	},
	{
		"thumb": "riva_thumb.jpg",
		"name": "Riva Kahn Hallock",
		"bio": "<p>Riva has enjoyed singing for as long as she can remember in musicals, in choir, and to herself. Besides driving her roommate and everyone else crazy with nonstop humming/singing, she also loves playing soccer, scuba diving, playing piano, being green, and trying new things.</p>",
		"class_number": "2015",
		"major": "MechE",
		"hometown": "Oakland, CA"
	},
	{
		"thumb": "eric_thumb.jpg",
		"name": "Eric \"The Franz\" Schneider",
		"bio": "<p>Eric has been singing more or less continuously since the beginning of high school, and is super excited to be able to keep singing at Olin. He also plays piano and listens to too many musicals. In addition to regular acapella excitement, he is extremely excited to be at Olin and do a bunch of awesome stuff, only some of which there will be time for. But hey, who really needs sleep?</p>",
		"class_number": "2015",
		"major": "Robo E",
		"hometown": "Bellingham, WA"
	},
	{
		"thumb": "ingrid_thumb.jpg",
		"name": "Ingrid Hagen-Keith",
		"bio": "<p>Ingrid's is so excited to be a part of PowerChords that she is charged to sing! (Did you catch that?) She hails from the northern land of Montreal, Canada but has recently been relocated to Kailua, HI. Though never formally trained, Ingrid has been part of various singing groups including a Scottish a cappella group, choir in high school, and has performed various solos, including her senior year closing song. When not singing, Ingrid likes to eat fine foods (om nom nom), run, sew, and talk about not talking. She is ready to rock y'all!</p>",
		"class_number": "2015",
		"major": "MechE",
		"hometown": "Everywhere"
	},
	{
		"thumb": "rahil_thumb.jpg",
		"name": "Rahil Dedhia",
		"bio": "<p>Rahil has been involved in music for most of his life, especially as a singer. During his high school years in hometown Pelham, NY, he sang as part of the chorus, select chorus, and took part in the school musical each year. Other than singing, Rahil enjoys theatre and sports, specifically tennis, soccer, and ultimate Frisbee. He has never been involved in a capella before, and is really excited about PowerChords this year.</p>",
		"class_number": "2016",
		"major": "Undeclared",
		"hometown": "Pelham, NY"
	},
	{
		"thumb": "mitch_thumb.jpg",
		"name": "Mitch Cieminski",
		"bio": "<p>Mitch is a Mysterious Engineer and he loves to sing. Hailing from Colorado, he is a fan of puzzles, classic rock, running, and baked goods. He is currently trying to learn everything in the Universe, a task that is surprisingly difficult but highly enjoyable.</p>",
		"class_number": "2016",
		"major": "Undeclared",
		"hometown": "Greeley, CO"
	},

	{
		"thumb": "paige_thumb.jpg",
		"name": "Paige Cote",
		"bio": "<p>Paige is a semi-undecided/Bio-E from mid-coast Maine, otherwise known as the place where all the tourists go. She has been singing since she was 8 in a church choir, and was also in all the vocal ensembles possible during high school. When she’s not singing you can probably find her reading, sailing, eating tasty things, or learning about something that will in no way enhance her engineering knowledge.</p>",
		"class_number": "2016",
		"major": "Undeclared",
		"hometown": "ME"
	},
	{
		"thumb": "jennifer_thumb.jpg",
		"name": "Jennifer Anderson",
		"bio": "<p>Jennifer has been singing since 4th grade, but never in a choir as small as PowerChords; which makes it all the more exciting and interesting! She loves doing way too many things—so besides PowerChords, she is also interested in 90% of the clubs on campus. Somehow, she also manages to fit in drawing, reading, and collecting classy hats.</p>",
		"class_number": "2016",
		"major": "Undeclared",
		"hometown": "Louisville, CO"
	},
	{
		"thumb": "marena_thumb.jpg",
		"name": "Marena Richardson",
		"bio": "<p>Marena has been singing for most of her life in school choirs, independent choirs, musicals, and even a high school acapella group. She is really excited to be able to continue singing with such an enthusiastic group here at Olin. Her other hobbies include dancing, reading, doing stuff outdoors, and hanging out with the awesome Freshman class.</p>",
		"class_number": "2016",
		"major": "Undeclared",
		"hometown": "RI"
	}
]