[
    {
        "title": "Headed to BOSS",
        "author": "Geoff Pleiss",
        "date": "03/08/13",
        "body": "We're headed to BOSS! We'll be performing an aca-bomb. Hopefully you'll get to here us sing there!"
    },

    {
        "title": "We got 3rd at ICCA!",
        "author": "Riva Kahn Hallock",
        "date": "02/17/13",
        "body": "For the first time in PowerChords history, we placed at ICCA quarterfinals!! Thank you to everyone who came out to support us and also to the other amazing groups who competed. It was an awesome quarterfinal to experience."
    },

    {
        "title": "ICCA IS SATURDAY 2/16!",
        "author": "Riva Kahn Hallock",
        "date": "02/14/13",
        "body": "Come support us on Saturday at 8pm at the International Championship of Collegiate A Cappella! Hurry, get your tickets!"
    },

    {
        "title": "Shameless Plug - Come See PowerChords Perform over Family Weekend",
        "author": "Riva Kahn Hallock",
        "date": "10/25/12",
        "body": "Family Weekend is THIS weekend, folks! And we have doubly exciting news! First, make sure to stop by AC 113 on Friday Oct. 26th to see PowerChords perform one of our sets at 4PM or 5:30PM. Second, come get your copy of our first track-by-track studio album, Shameless Plug! Our official release date is this Friday and we will be selling copies for just $15. If you thought Surge was great, you won't want to miss Shameless Plug! Right now the only way to get a copy is to come visit us at Olin, so we'll see you soon!"
    },

    {
        "title": "New Members",
        "author": "Riva Kahn Hallock",
        "date": "09/06/12",
        "body": "Welcome to our new, first-year members: Marena, Jennifer, Paige, Rahil, and Mitch!! Based on our first full rehearsal tonight, it looks/sounds like we have an incredible semester ahead..."
    },

    {
        "title": "Thanks for another great year!",
        "author": "Jessie Rucker",
        "date": "05/20/12",
        "body": "Congratulations to our five seniors who graduated from Olin today!! We had a fun, impromptu concert in the dining hall to send us off. We had a fabulous year and I can't wait to see what happens next year. This is Jessie, signing off as your (now former) PowerChords President."
    },   

    {
        "title": "Get Revved up for our Spring Concert!",
        "author": "Jessie Rucker",
        "date": "04/19/12",
        "body": "Our Spring Concert is just over two weeks away! We'll see you May 4th, 7:30PM in Milas Auditorium. Oh, and study up on Brawl and your Gameboy in the meantime..."
    },

    {
        "title": "ICCA 2012!",
        "author": "Jessie Rucker",
        "date": "11/15/11",
        "body": "That's right! Your very own Olin PowerChords have once again qualified for ICCA - the International Championship for Collegiate A Cappella. With last year's experience under our belt we hope to deliver an even more amazing performance this year! Our quarterfinal placement still to be announced. See varsityvocals.com for more details."
    },

    {
        "title": "Performances - next two weeks",
        "author": "Jessie Rucker",
        "date": "11/2/11",
        "body": "PowerChords will be performing at Needham High School's Take Back the Night event on Friday November 4th at Needham High School. The event starts at 6PM. The following week on Friday Novemeber 11th we'll be performing at the Wellesley Blue Notes Make-A-Wish Foundation Charity Concert in Alumnae Hall. This concert will start at 7:30PM and many other groups (a cappella and dance!) will be performing. Should be a good time!"
    },

    {
        "title": "Family Weekend Performance",
        "author": "Jessie Rucker",
        "date": "10/12/2011",
        "body": "PowerChords will be performing at 5:30PM on Friday of Family Weekend (10/14) in the 3rd floor hallway of the Academic Center! We will also be doing a \"reprise\" informal performance at 1PM on Saturday in the Wooden Waterfall for those of you who cannot make our Friday performance. See you this weekend!"
    },

    {
        "title": "Last Minute Performance - Alumni Weekend",
        "author": "Jessie Rucker",
        "date": "09/22/2011",
        "body": "PowerChords will be performing at 1:15PM on Alumni Weekend in the elevator nook by the dining hall. Join the Alumni and hear at least one debut song!"
    }
]